# specify a directory to install
cask_args appdir: '/Applications'

# Taps
tap "homebrew/cask-drivers"

# Misc Utilities
brew "mas"
brew "nmap"
brew "telnet"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Cask Apps
cask "visual-studio-code"
cask "alfred"
cask "anylist"
cask "mattermost"
cask "resilio-sync"
cask "ring"
cask "setapp"
cask "adobe-creative-cloud"
cask "tower"
cask "transmit"
cask "google-chrome"
cask "iterm2"
cask "notable"
cask "controlplane"
cask "logitech-options"
cask "docker"
cask "fontbase"
cask "android-studio"
cask "keyboard-maestro"
cask "textexpander"
#cask "default-folder-x" //TODO: Not Ready, using a manually downloaded beta

# Mac App Store Apps
mas "1Password 7", id: 1333542190
mas "Ring", id: 1142753258
mas "Drafts", id: 1435957248
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Slack", id: 803453959
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mimeo Photos", id: 1282504627
mas "iHosts", id: 1102004240
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Wireguard", id: 1451685025

# This will go away once I'm done converting
mas "Bear", id: 1091189122

#TODO: Update when released. I manually downloaded the XCode 12 Beta from the Apple Developer Site. 
#mas "Xcode", id: 497799835