# specify a directory to install
cask_args appdir: '/Applications'

# Taps
tap "homebrew/cask-drivers"

# Misc Utilities
brew "mas"
brew "nmap"
brew "telnet"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "go"
brew "python"

# Cask Apps
cask "obsidian"
cask "visual-studio-code"
cask "alfred"
cask "anylist"
cask "mattermost"
cask "resilio-sync"
cask "adobe-creative-cloud"
cask "tower"
cask "transmit"
cask "iterm2"
cask "logitech-options"
cask "docker"
cask "fontbase"
cask "android-studio"
cask "keyboard-maestro"
cask "textexpander"
cask "karabiner-elements"
cask "brave-browser"
cask "default-folder-x"
cask "owncloud"
cask "microsoft-office"
cask "autodesk-fusion360"
cask "vlc"
cask "sonos"
cask "beyond-compare"
cask "prusaslicer"

# Mac App Store Apps
mas "Xcode", id: 497799835
mas "1Password 7", id: 1333542190
mas "Ring", id: 1142753258
mas "Drafts", id: 1435957248
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mimeo Photos", id: 1282504627
mas "iHosts", id: 1102004240
mas "Fantastical", id: 975937182
mas "Wireguard", id: 1451685025
mas "Todoist: To-Do List & Tasks", id: 585829637
mas "Spark – Email App by Readdle", id: 1176895641
mas "AutoMounter", id: 1160435653
mas "HP Smart for Desktop", id: 1474276998
mas "MindNode - Mind Map", id: 1289197285
mas "FileZilla Pro - FTP and Cloud", id: 1298486723
mas "Deliveries: a package tracker", id: 290986013